Challenges/regftr_app_api/app/controllers/gifts_controller.rb

SELECT "gifts".* FROM "gifts"
---
    def index
        puts "====params===="
        puts params
        puts "====params===="
        render json: {
            status: 200,
            gifts: Gift.all

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        puts "====params===="
        puts params
        puts "====params===="
        #Find the specific gift we are looking for
        gift = Gift.find(params[:id])

INSERT INTO "gifts" ("description", "value", "event", "gift_giver") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Lakers Tickets"], ["value", "200.0"], ["event", "Why not"], ["gift_giver", "Mom"]]
---
    def create
        gift = Gift.new(gift_params)
        if gift.save

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "gifts" SET "description" = $1 WHERE "gifts"."id" = $2  [["description", "lulu lemon"], ["id", 3]]
---
    def update
        gift = Gift.find(params[:id])
        gift.update(gift_params)

DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 5]]
---
    def destroy
        gift = Gift.destroy(params[:id])