Challenges/icescript_icecream/icescript_icecream_api/app/controllers/ice_creams_controller.rb

  def index
    @ice_creams = IceCream.all
---
SELECT "ice_creams".* FROM "ice_creams"

    def set_ice_cream
      @ice_cream = IceCream.find(params[:id])
---
SELECT "ice_creams".* FROM "ice_creams" WHERE "ice_creams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]