Challenges/icescript_icecream/icescript_icecream_api/app/controllers/pints_controller.rb

SELECT "pints".* FROM "pints"
---
  def index
    @pints = Pint.all