To-Do-Proejct/todo_api/app/controllers/todos_controller.rb

  def index
    sunday = Todo.where(day: "Sunday")
    monday = Todo.where(day: "Monday")
    tuesday = Todo.where(day: "Tuesday")
    wednesday = Todo.where(day: "Wednesday")
    thursday = Todo.where(day: "Thursday")
    friday = Todo.where(day: "Friday")
    saturday = Todo.where(day: "Saturday")
---
SELECT "todos".* FROM "todos" WHERE "todos"."day" = $1  [["day", "Monday"]]
SELECT "todos".* FROM "todos" WHERE "todos"."day" = $1  [["day", "Sunday"]]

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("task", "department", "created_at", "updated_at", "day") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["task", "Study for CPT"], ["department", "Personal"], ["created_at", "2020-12-23 23:17:40.719577"], ["updated_at", "2020-12-23 23:17:40.719577"], ["day", "Wednesday"]]