Challenges/dating_app/dating_app_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.sample(3)

INSERT INTO "users" ("name", "starsign", "age", "img", "ltl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save